/* auto generated tasks.rexx */
projectpath = arg(1)
scripts = projectpath'/scripts'
infile = ''
outfile = ''
tcount = 0
fatal = 0
skiptasks = 0
nameext = 'name'
