file = 'D:\path\file.txt'
infolevel = 5
say "input   drivepath('D:\path\file.txt')"
say "returns" drivepath(file)
say "expect  D:\path\"
exit

