say "input   ext('C:\WINDOWS\UTIL\file.ext') ext('C:\WINDOWS\UTIL\file.bak.ext')"
say "returns" ext('C:\WINDOWS\UTIL\file.ext') ext('C:\WINDOWS\UTIL\file.bak.ext')
say "expect  .ext .ext"
exit

