t1 = "D:\All-SIL-Publishing\github-SILAsiaPub\xrunner\branches\rexx\_xrunner_projects\Modify-LIFT\source\lexicon.lift"
outfile = "D:\All-SIL-Publishing\github-SILAsiaPub\xrunner\branches\rexx\_xrunner_projects\Modify-LIFT\source\notthere.txt"

say 'valid input' infile(t1,outfile)
say 'invalid input' infile(t3,outfile)

exit

