say "input   nameext('C:\WINDOWS\UTIL\file.ext') nameext('C:\WINDOWS\UTIL\file.bak.ext')"
say "returns" nameext('C:\WINDOWS\UTIL\file.ext') nameext('C:\WINDOWS\UTIL\file.bak.ext')
say "expect  file file.bak"
exit

