say "input   name('C:\WINDOWS\UTIL\file.ext') name('C:\WINDOWS\UTIL\file.bak.ext')"
say "returns" name('C:\WINDOWS\UTIL\file.ext') name('C:\WINDOWS\UTIL\file.bak.ext')
say "expect  file file.bak"
exit

